# SetValue Method (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..SetValue Method (ElementId)
ScheduleFilter Class See Also
---
Set the filter value to an ElementId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetValue(
	ElementId id
)
```

Visual Basic
---
```text
Public Sub SetValue ( _
	id As ElementId _
)
```

Visual C++
---
```text
public:
void SetValue(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The filter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace